DataProcessors/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЦеныЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЦеныЗакупки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document._Инвойс</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>InformationRegister.ЦеныЗакупки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ОприходованиеНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварУжеОплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументСкидки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_СкидкаПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_НеСоздаватьПриходную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументЗатрат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_ДополнительныеЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСЗатратами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ИнвойсПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗамены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗатраты_</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_СуммаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_СуммаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументЗатрат</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВКД_ДополнительныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Замены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЦеныПоставщиков/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Номенклатура = Параметры.Номенклатура;  
	Если Параметры.Свойство("СформироватьПриОткрытии") Тогда
		СформироватьПриОткрытии =	Параметры.СформироватьПриОткрытии;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьЦеныНаСервере()
	
	ДиаграммаЦен.Обновление = Ложь;
	ДиаграммаЦен.Очистить();
	ДиаграммаЦен.АвтоТранспонирование = Ложь;
	ДиаграммаЦен.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	
	ЗапрМин = Новый Запрос;  
	ЗапрМин.УстановитьПараметр("Номенклатура",  Номенклатура); 
	ЗапрМин.УстановитьПараметр("Валюта", 		Валюта); 
	ЗапрМин.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	НАЧАЛОПЕРИОДА(ЦеныЗакупки.Период, ДЕНЬ) КАК Дата
	                |ИЗ
	                |	РегистрСведений.ЦеныЗакупки КАК ЦеныЗакупки
	                |ГДЕ
	                |	ЦеныЗакупки.Номенклатура = &Номенклатура
	                |	И ЦеныЗакупки.Валюта = &Валюта
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Дата";
	ВыборкаМин = ЗапрМин.Выполнить().Выбрать();	
	Если ВыборкаМин.Следующий() Тогда
	    НачалоПериода = ВыборкаМин.Дата;
	Иначе	
		НачалоПериода = Дата(2016, 4, 1);	
	КонецЕсли;
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Номенклатура",  Номенклатура); 
	Запр.УстановитьПараметр("НачалоПериода", НачалоПериода); 
	Запр.УстановитьПараметр("Валюта", 		 Валюта); 
	Запр.Текст = "ВЫБРАТЬ
	             |	ЦеныЗакупкиСрезПервых.Номенклатура,
	             |	ЦеныЗакупкиСрезПервых.Поставщик,
	             |	ЦеныЗакупкиСрезПервых.Цена,
	             |	ЦеныЗакупкиСрезПервых.Регистратор,
	             |	ЦеныЗакупкиСрезПервых.Регистратор.Валюта КАК Валюта,
	             |	&НачалоПериода КАК Период
	             |ИЗ
	             |	РегистрСведений.ЦеныЗакупки.СрезПервых(
	             |			&НачалоПериода,
	             |			Номенклатура = &Номенклатура
	             |				И Валюта = &Валюта) КАК ЦеныЗакупкиСрезПервых
	             |
	             |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ
	             |	ЦеныЗакупки.Номенклатура,
	             |	ЦеныЗакупки.Поставщик,
	             |	ЦеныЗакупки.Цена,
	             |	ЦеныЗакупки.Регистратор,
	             |	ЦеныЗакупки.Регистратор.Валюта,
	             |	НАЧАЛОПЕРИОДА(ЦеныЗакупки.Период, ДЕНЬ)
	             |ИЗ
	             |	РегистрСведений.ЦеныЗакупки КАК ЦеныЗакупки
	             |ГДЕ
	             |	ЦеныЗакупки.Номенклатура = &Номенклатура
	             |	И ЦеныЗакупки.Валюта = &Валюта
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Период"; 
	
	МаксЗначение = 0;
	МинЗначение = 1000000000;

	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Серия = ДиаграммаЦен.УстановитьСерию(Строка(Выборка.Поставщик));
		//Серия.Цвет = Обработки.УдалитьМониторыРуководителя.ЦветДляМониторов("Синий");
		//Серия.Линия = Новый Линия(ТипЛинииДиаграммы.Сплошная, 2);
		//Серия.Маркер = ТипМаркераДиаграммы.Нет;
		
		Точка = ДиаграммаЦен.УстановитьТочку(Формат(Выборка.Период,"ДФ=dd.MM.yy"));
		Точка.Расшифровка = Выборка.Цена; 
		Подсказка = СтрШаблон("%1 %2
							|%3 
							|%4",
							Выборка.Цена, Валюта.Символ, Выборка.Регистратор, Выборка.Поставщик);
		
		ДиаграммаЦен.УстановитьЗначение(Точка, Серия, Выборка.Цена, Точка.Расшифровка, Подсказка);
		
		//Выборка = ВыборкаПоставщик.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//Пока Выборка.Следующий() Цикл
		//	
		//	лДата = НачалоДня(Выборка.Регистратор.Дата);
		//	ИндексТочки = МассивТочек.Найти(лДата);
		//	Точка = ДиаграммаЦен.Точки.Получить(ИндексТочки);
		//	//Точка.Текст = Формат(лДата, "ДФ=dd.MM.yy");
		//	//Точка.Расшифровка = Регистратор.Дата;  
		//	Точка.Расшифровка = Выборка.Регистратор;
		//	//Подсказка = ?(ПрибыльУбыток < 0, НСтр("ru='Убыток ';uk='Збиток '") + -ПрибыльУбыток, НСтр("ru='Прибыль ';uk='Прибуток '") + ПрибыльУбыток) + " на " + Формат(Выборка.Период, "ДФ=dd.MM.yyyy");
		//	Подсказка = Выборка.Регистратор;
		//	ДиаграммаЦен.УстановитьЗначение(Точка, Серия, Выборка.Цена, Точка.Расшифровка, Подсказка);
		//	
			Цена = Выборка.Цена;
			Если Цена > МаксЗначение Тогда
				МаксЗначение = Цена;
			ИначеЕсли Цена < МинЗначение Тогда
				МинЗначение = Цена;
			КонецЕсли;

		//	Сообщить(Строка(ВыборкаПоставщик.Поставщик) + ": "+ Точка.Текст);

		//КонецЦикла;
		
	
	КонецЦикла; 
	
	
	////ДиаграммаЦен.МаксимальноеЗначение = Макс(Макс(МаксЗначение, -МаксЗначение), Макс(МинЗначение, -МинЗначение));
	////ДиаграммаЦен.МинимальноеЗначение = -ДиаграммаЦен.МаксимальноеЗначение;
	//
	////ДиаграммаЦен.АвтоМаксимальноеЗначение = Ложь;
	ДиаграммаЦен.АвтоМинимальноеЗначение = Ложь;
	ДиаграммаЦен.МинимальноеЗначение	= Окр(МинЗначение * 0.95, -2);
	////ДиаграммаЦен.МаксимальноеЗначение 	= Окр(ВыборкаГраниц.ЦенаМакс * 1.2, -2);
	//ДиаграммаЦен.БазовоеЗначение = Окр(ВыборкаГраниц.ЦенаМин * 0.6, -2);
	                                                                  
	ДиаграммаЦен.АвтоТранспонирование = Истина;
	ДиаграммаЦен.Обновление = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЦены(Команда)
	ПоказатьЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРСПоПриходнымНаСервере(Ном)
	
	Запр = Новый Запрос;    
	Запр.УстановитьПараметр("Номенклатура", Номенклатура);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ПриходнаяНакладнаяТовары.Ссылка КАК Регистратор,
	             |	ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	             |	ПриходнаяНакладнаяТовары.ЦенаЗакупки КАК ЦенаЗакупки
	             |ИЗ
	             |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	             |ГДЕ
	             |	ПриходнаяНакладнаяТовары.Ссылка В
	             |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |				ПНТовары.Ссылка
	             |			ИЗ
	             |				Документ.ПриходнаяНакладная.Товары КАК ПНТовары
	             |			ГДЕ
	             |				ПНТовары.Ссылка.Проведен
	             |				И ПНТовары.Ссылка.Окончательно
	             |				И ПНТовары.Номенклатура = &Номенклатура)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ПриходнаяНакладнаяТовары.Ссылка.Дата,
	             |	Номенклатура
	             |ИТОГИ
	             |	СРЕДНЕЕ(ЦенаЗакупки)
	             |ПО
	             |	Регистратор,
	             |	Номенклатура";	
	ВыборкаР = Запр.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаР.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.ЦеныЗакупки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаР.Регистратор); 
		лДата 		= ВыборкаР.Регистратор.Дата;
		лВалюта 	= ВыборкаР.Регистратор.Валюта; 
		лПоставщик 	= ВыборкаР.Регистратор.Контрагент;
		//Сообщить("==============================");
		//Сообщить(ВыборкаР.Регистратор);
		ВыборкаН = ВыборкаР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаН.Следующий() Цикл
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Регистратор 	= ВыборкаР.Регистратор;
			НоваяЗапись.Номенклатура	= ВыборкаН.Номенклатура;	
			НоваяЗапись.Поставщик		= лПоставщик;	
			НоваяЗапись.Цена			= ВыборкаН.ЦенаЗакупки;  
			НоваяЗапись.Валюта			= лВалюта;  
			НоваяЗапись.Период			= лДата;
			//Сообщить(СтрШаблон("   %1 (%2)", ВыборкаН.Номенклатура, лПоставщик));
		КонецЦикла; 
		//Сообщить("   = " + ВыборкаН.Количество());
		НаборЗаписей.Записать(Истина);
		Ном = Ном + 1; 
		
		//Прервать;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРСПоПриходным(Команда)
	Ном = 0;
	ЗаполнитьРСПоПриходнымНаСервере(Ном); 
	Сообщить("Добавлено записей: "+Ном);
КонецПроцедуры

&НаСервере
Процедура ОчиститьРСНаСервере(Ном)  
	
	Запр = Новый Запрос;     
	Запр.УстановитьПараметр("БезВалюты", Справочники.Валюты.ПустаяСсылка());
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	             |	ЦеныЗакупки.Регистратор
	             |ИЗ
	             |	РегистрСведений.ЦеныЗакупки КАК ЦеныЗакупки
	             |ГДЕ
	             |	ЦеныЗакупки.Валюта = &БезВалюты"; 
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.ЦеныЗакупки.СоздатьНаборЗаписей(); 
		Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
		Набор.Записать(); 
		Ном = Ном + 1;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРС(Команда) 
	Ном = 0;
	ОчиститьРСНаСервере(Ном);
	Сообщить("Удалено наборов записей: "+Ном);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СформироватьПриОткрытии Тогда
	   ПоказатьЦеныНаСервере();
   КонецЕсли;
   
КонецПроцедуры
